#+title:  Evaluaci贸n de la exposici贸n
#+author: Gunnar Wolf

* Sistemas Operativos de Tiempo Real

- Tema presentado por :: David Nava y David Tavera
- Calificaci贸n global :: Por favor lean todo el archivo para entender de d贸nde
  vienen todos estos n煤meros 

|------------------------+------+--------------------+------+---------|
| Evaluaci贸n  compa帽eros | Peso | Evaluaci贸n docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                   9.17 |  0.3 |               8.35 |  0.7 |    8.60 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Comentarios

Dado que es una presentaci贸n en video, no puedo evaluar /dominio del tema/ y
/presencia/ como lo har铆amos habitualmente. Me centro en las respuestas que
hagan a las preguntas de sus compa帽eros para el primero y en si la presentaci贸n
"suena" le铆da directamente del material que prepararon o expuesta m谩s libremente
para el segundo.


* Evaluaci贸n grupal

|              | 1 | 2 | 3 |  4 |  5 | Total |
|--------------+---+---+---+----+----+-------|
| Originalidad | 0 | 0 | 2 | 10 | 15 |  8.96 |
| Nivel        | 0 | 0 | 0 |  8 | 19 |  9.41 |
| Relevancia   | 0 | 0 | 2 |  2 | 23 |  9.56 |
| Claridad     | 0 | 0 | 1 | 13 | 13 |  8.89 |
| Presencia    | 0 | 0 | 3 |  7 | 17 |  9.04 |
|--------------+---+---+---+----+----+-------|
|              |   |   |   |    |    |  9.17 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compa帽eros

Su exposici贸n recibi贸 los siguientes comentarios anonimizados por
parte de sus compa帽eros:

- La exposici贸n estuvo muy completa y hacen gran uso de la presentaci贸n
  solamente como apoyo para complementar la informaci贸n. Los ejemplos son de
  gran utilidad para que se expliquen bien los temas explicados. El tema es
  relevante para la materia ya que ocupan temas como los explicados en clase
  (MUTEX y sem谩foros), adem谩s de que no ocupan palabras o t茅rminos complejos que
  sean dif铆ciles de comprender.
- El tema que eligieron mis compa帽eros sin duda alguna es algo muy interesante,
  sabemos que un RTOS no es r谩pido por as铆 decirlo, pero si es predecible, esto
  nos garantiza que ciertas tareas se ejecuten en tiempo exactos, sin duda
  alguna los casi 18 minutos de video fueron suficientes para indagar un poco
  mas al respecto de este tema, una felicitaci贸n a mis compa帽eros por este
  trabajo.
- Muy buena presentaci贸n, pero los nervios los hac铆an trabarse
  constantemente. Tal vez podr铆an omitir el uso de la c谩mara web para evitar
  esto
- Solo falt贸 un poco de fluidez al hablar durante la exposici贸n, especialmente
  al inicio de esta, fuera de eso buen trabajo
- La exposici贸n es buena, pero en lo personal me hubiera gustado un poco mas de claridad,
- ninguno

* Evaluaci贸n por parte del docente

| *Aspecto*                          | *Peso* | *Evaluaci贸n* | *Puntos* |
|------------------------------------+--------+--------------+----------|
| Contenido t茅cnico y profunidad     |    0.3 |           10 |       3. |
| Fuentes bibliogr谩ficas             |   0.15 |            7 |     1.05 |
| Organizaci贸n                       |   0.15 |           10 |      1.5 |
| Comunicaci贸n oral y uso del tiempo |   0.25 |            7 |     1.75 |
| Uso de recursos visuales           |   0.15 |            7 |     1.05 |
|------------------------------------+--------+--------------+----------|
| *Global*                           |        |              |     8.35 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios del docente
- El material preparado es bueno, pero el ritmo que da el irlo leyendo le resta
  dinamismo a la presentaci贸n
- Presentan varias fuentes bibliogr谩ficas interesantes, pero no mencionan en el
  texto d贸nde se emple贸 cada una de ellas (no se hace un citado expreso para
  apoyar el punto en que se refieren a los distintos conceptos).
- Los ejemplos son muy buenos, pero falta un poco el considerar cu谩l ser铆a el
  efecto de no contar con un sistema de tiempo real.
  - Muy correcto que mencionaran en qu茅 谩reas es fundamental la planificaci贸n RT
    (medicina), pero mencionaron el /campo/... no las /necesidades espec铆ficas/
    que el RTOS atender铆a.

